# [10 Minutes to pandas — pandas 0.23.3 documentation](https://pandas.pydata.org/pandas-docs/stable/10min.html)

# Object Creation
# Viewing Data
1조: 처음~22번

# Selection
## Getting
## Selection by Label
## Selection by Position
## Boolean Indexing
## Setting
2조: 23~54번

# Missing Data
# Operations
## Stats
## Apply
## Histogramming
## String Methods
3조: 55~72번

# Merge
## Concat
## Join
## Append
4조: 73~90번

# Grouping

`그룹화`는 다음 단계 중 하나 이상을 포함하는 프로세스를 나타냅니다.

- 몇 가지 기준에 따라 그룹으로 데이터 분할
- 독립적으로 각 그룹에 기능 적용
- 결과를 데이터 구조로 결합

그룹화 섹션을 봅시다

In [3]:
## 향후 삭제해도 되는 부분
In [1]: import pandas as pd

In [2]: import numpy as np

In [3]: import matplotlib.pyplot as plt

In [4]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    })

In [5]:
df

     A      B         C         D
0  foo    one  1.242203  0.585931
1  bar    one -0.803583 -0.279826
2  foo    two  0.551023  1.391615
3  bar  three -0.066917  0.360173
4  foo    two -0.783369  0.501214
5  bar    two -0.014651  0.675781
6  foo    one  1.375350  0.884490
7  foo  three  1.114174  1.830266

'A'를 기준으로 그룹화를 한 다음, 그 결과로 나온 그룹에 sum () 함수를 적용합니다.

In [6]:
df.groupby('A').sum()

            C         D
A
bar -0.885152  0.756129
foo  3.499380  5.193516

여러 열로 그룹화하면 계층적 index가 만들어집니다. 여기에도 sum 함수를 적용 할 수 있습니다.

In [7]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.803583 -0.279826
    three -0.066917  0.360173
    two   -0.014651  0.675781
foo one    2.617553  1.470421
    three  1.114174  1.830266
    two   -0.232346  1.892828

# Reshaping
## Stack
## Pivot Tables

# Time Series
6조: 108~126

# Categoricals
# Plotting
7조: 127~140

# Getting Data In/Out
## CSV
## HDF5
## Excel
# Gotchas
8조: 141~끝